ci4/app/Controllers/Antrian.php

    public function add()
    {
        $title = 'Ambil Antrian';
        $pelayanan = $this->pelayanan->findAll();
        $loket = $this->loket->findAll();
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['pelayanan_id' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $antrian = new AntrianModel();
            $antrian->insert([
                'no_antrian' => $this->request->getPost('antrian_id'),
                // 'tanggal' => $this->request->getPost('tanggal'),
                'waktu_panggil' => $this->request->getPost('waktu_panggil'),
                'waktu_selesai' => $this->request->getPost('waktu_selesai'),
                'pelayanan_id' => $this->request->getPost('pelayanan_id'),
                'loket_id' => $this->request->getPost('loket_id'),
            ]);
---
SELECT *
FROM `pelayanan`
SELECT *
FROM `loket`
INSERT INTO `antrian` (`no_antrian`, `waktu_panggil`, `waktu_selesai`, `pelayanan_id`, `loket_id`, `tanggal`) VALUES (NULL, NULL, NULL, '2', '19', '2022-07-07 08:41:29')